apple-open-source/macos/IOUSBFamily/AppleUSBOHCI/Classes/AppleUSBOHCI_UIM.cpp
        if ( (hcFrameNumber > 5) && (hcFrameNumber > (hccaFrameNumber+5)) )
        {
            USBError(1,"AppleUSBOHCI[%p] Watchdog detected dead controller (hcca #: %ld, hc #: %ld)", this,  (UInt32) hccaFrameNumber, (UInt32) hcFrameNumber);
                    
            // Save registers
            //
            fmInterval = _pOHCIRegisters->hcFmInterval;
            hcca = _pOHCIRegisters->hcHCCA;
            bulkHead = _pOHCIRegisters->hcBulkHeadED;
            controlHead = _pOHCIRegisters->hcControlHeadED;
            periodicStart = _pOHCIRegisters->hcPeriodicStart;
            intEnable = _pOHCIRegisters->hcInterruptEnable;
            fmNumber = _pOHCIRegisters->hcFmNumber;
            
            _pOHCIRegisters->hcCommandStatus = HostToUSBLong(kOHCIHcCommandStatus_HCR);  // Reset OHCI 
            IOSleep(3);
            
            // Restore registers
            //
            _pOHCIRegisters->hcFmNumber = fmNumber;
            _pOHCIRegisters->hcInterruptEnable = intEnable;
            _pOHCIRegisters->hcPeriodicStart = periodicStart;
            _pOHCIRegisters->hcBulkHeadED = bulkHead;
            _pOHCIRegisters->hcControlHeadED = controlHead;
            _pOHCIRegisters->hcHCCA = hcca;
            _pOHCIRegisters->hcFmInterval = fmInterval;
            IOSync();
			// i did not put the NEC incomplete write check in here
			// because this is the _needsWatchdog errata and they are
			// two different errata bits
						
            _pOHCIRegisters->hcControl = HostToUSBLong(kOHCIFunctionalState_Resume << kOHCIHcControl_HCFSPhase);
            
            if (_errataBits & kErrataLucentSuspendResume)
            {
                // JRH 08-27-99
                // this is a very simple yet clever hack for working around a bug in the Lucent controller
                // By using 35 instead of 20, we overflow an internal 5 bit counter by exactly 3ms, which 
                // stops an errant 3ms suspend from appearing on the bus
                //
                IOSleep(35);
            }
            else
            {
                IOSleep(20);
            }
            
            // Turn back on all the processing
            //
            _pOHCIRegisters->hcControl = HostToUSBLong(kOHCIFunctionalState_Operational << kOHCIHcControl_HCFSPhase);
            
            // Wait the required 3 ms before turning on the lists
            //
            IOSleep(3);			
            
            _pOHCIRegisters->hcControl =  HostToUSBLong((kOHCIFunctionalState_Operational << kOHCIHcControl_HCFSPhase)
                                                | kOHCIHcControl_CLE | (_OptiOn ? kOHCIHcControl_Zero : kOHCIHcControl_BLE) 
                                                | kOHCIHcControl_PLE | kOHCIHcControl_IE);
        }
    }
}



IOReturn 
AppleUSBOHCI::UIMCreateIsochTransfer(short						functionAddress,
									 short						endpointNumber,
									 IOUSBIsocCompletion		completion,
									 UInt8						direction,
									 UInt64						frameNumberStart,
									 IOMemoryDescriptor *		pBuffer,
									 UInt32						frameCount,
									 IOUSBLowLatencyIsocFrame *	pFrames,
									 UInt32						updateFrequency)
{
	
	USBError(1, "AppleUSBOHCI::UIMCreateIsochTransfer(LL) - old method");
	return kIOReturnIPCError;
}



IOReturn
AppleUSBOHCI::UIMCreateIsochTransfer(IOUSBIsocCommand *command)
{
	UInt8										direction = command->GetDirection();
	USBDeviceAddress							functionAddress = command->GetAddress();
	UInt8										endpointNumber = command->GetEndpoint();
	IOUSBIsocCompletion							completion = command->GetUSLCompletion();
	UInt64										frameNumberStart = command->GetStartFrame();
	IOMemoryDescriptor *						pBuffer = command->GetBuffer();
	UInt32										frameCount = command->GetNumFrames();
	IOUSBIsocFrame *							pFrames = command->GetFrameList();
	IOUSBLowLatencyIsocFrame *					pLLFrames = (IOUSBLowLatencyIsocFrame *)pFrames;
	UInt32										updateFrequency = command->GetUpdateFrequency();
	bool										requestFromRosettaClient = command->GetIsRosettaClient();
	bool										lowLatency = command->GetLowLatency();
	IODMACommand *								dmaCommand = command->GetDMACommand();
    IOReturn									status = kIOReturnSuccess;
    AppleOHCIIsochTransferDescriptorPtr			pTailITD = NULL;
    AppleOHCIIsochTransferDescriptorPtr			pNewITD = NULL;
    AppleOHCIIsochTransferDescriptorPtr			pTempITD = NULL;
    UInt32										i;
    UInt32										curFrameInRequest = 0;
    UInt32										bufferSize = 0;
    UInt32										pageOffset = 0;
    UInt32										segmentEnd = 0;
    UInt32										lastPhysical = 0;
    AppleOHCIEndpointDescriptorPtr				pED;
    UInt32										curFrameInTD = 0;
    UInt16										frameNumber = (UInt16) frameNumberStart;
    UInt64										curFrameNumber = GetFrameNumber();
    UInt64										frameDiff;
    UInt64										maxOffset = (UInt64)(0x00007FF0);
    UInt32										diff32;
	
    UInt32										itdFlags = 0;
    UInt32										numSegs = 0;
    UInt32										physPageStart = 0;
    UInt32										prevFramesPage = 0;
    UInt32										physPageEnd = 0;
    UInt32										pageSelectMask = 0;
    bool										needNewITD;
    bool										multiPageSegment = false;
    UInt32										tdType;
    IOByteCount									transferOffset;
    bool										useUpdateFrequency = true;
	UInt64										offset;
	IODMACommand::Segment64						segments64[2];
	IODMACommand::Segment32						segments32[2];
	UInt32										edFlags;
	UInt32										maxPacketSize;
	
    if ( (frameCount == 0) || (frameCount > 1000) )
    {
        USBLog(3,"AppleUSBOHCI[%p]::UIMCreateIsochTransfer bad frameCount: %ld", this, frameCount);
        return kIOReturnBadArgument;
    }
	
    if (direction == kUSBOut) 
	{
        direction = kOHCIEDDirectionOut;
        tdType = lowLatency ? kOHCIIsochronousOutLowLatencyType : kOHCIIsochronousOutType;
    }
    else if (direction == kUSBIn) 
	{
        direction = kOHCIEDDirectionIn;
        tdType = lowLatency ? kOHCIIsochronousInLowLatencyType : kOHCIIsochronousInType;
    }
    else
        return kIOReturnInternalError;
	
	if (!dmaCommand)
	{
        USBError(1,"AppleUSBOHCI[%p]::UIMCreateIsochTransfer no dmaCommand", this);
        return kIOReturnInternalError;
	}
	
	if (dmaCommand->getMemoryDescriptor() != pBuffer)
	{
        USBError(1,"AppleUSBOHCI[%p]::UIMCreateIsochTransfer - memory desc in dmaCommand (%p) different than IOMD (%p)", this, dmaCommand->getMemoryDescriptor(), pBuffer);
        return kIOReturnInternalError;
	}
	
    pED = FindIsochronousEndpoint(functionAddress, endpointNumber, direction, NULL);
	
