apple-open-source/macos/IOUSBFamily/AppleUSBOHCI/Classes/AppleUSBOHCI_UIM.cpp
	USBLog(2, "AppleUSBOHCI[%p]::UIMEnableAllEndpoints(%s)", this, enable ? "true" : "false");
	// look through the lists one at a time - Control first
    pEDQueue = _pControlHead;
    while (pEDQueue != _pControlTail)
    {
		edFlags = USBToHostLong(pEDQueue->pShared->flags);
		if ((edFlags & kOHCISkipped) && (edFlags & kOHCIEDControl_FA))
		{
			USBLog(2, "AppleUSBOHCI[%p]::UIMEnableAllEndpoints - found skipped Control ED[%p] for ADDR[%d] ", this, pEDQueue, (int)(edFlags & kOHCIEDControl_FA));
			edFlags &= ~kOHCISkipped;
			pEDQueue->pShared->flags = HostToUSBLong(edFlags);
			IOSync();
		}
		
		pEDQueue = (AppleOHCIEndpointDescriptorPtr) pEDQueue->pLogicalNext;
	}
    pEDQueue = _pBulkHead;
    while (pEDQueue != _pBulkTail)
    {
		edFlags = USBToHostLong(pEDQueue->pShared->flags);
		if ((edFlags & kOHCISkipped) && (edFlags & kOHCIEDControl_FA))
		{
			USBLog(2, "AppleUSBOHCI[%p]::UIMEnableAllEndpoints - found skipped Bulk ED[%p] for ADDR[%d] ", this, pEDQueue, (int)(edFlags & kOHCIEDControl_FA));
			edFlags &= ~kOHCISkipped;
			pEDQueue->pShared->flags = HostToUSBLong(edFlags);
			IOSync();
		}
		
		pEDQueue = (AppleOHCIEndpointDescriptorPtr) pEDQueue->pLogicalNext;
	}
    for (i = 0; i < 63; i++)
    {
        pEDQueue = _pInterruptHead[i].pHead;
        
        while (pEDQueue != _pInterruptHead[i].pTail)
        {
			edFlags = USBToHostLong(pEDQueue->pShared->flags);
			if ((edFlags & kOHCISkipped) && (edFlags & kOHCIEDControl_FA))
			{
				USBLog(2, "AppleUSBOHCI[%p]::UIMEnableAllEndpoints - found skipped Interrupt ED[%p] for ADDR[%d] ", this, pEDQueue, (int)(edFlags & kOHCIEDControl_FA));
				edFlags &= ~kOHCISkipped;
				pEDQueue->pShared->flags = HostToUSBLong(edFlags);
				IOSync();
			}
            pEDQueue = pEDQueue->pLogicalNext;
        }
    }
	return kIOReturnSuccess;
}	
